# Задача 4: Проверка на четность
# Напишите программу, которая запрашивает у пользователя число и определяет, является ли оно четным или нечетным.
# Пример:
# Ввод: 8
# Вывод: Число 8 четное
print ('hh')
c = int(input())
a = c//2
b = c/2
if (b == a):
   print ('chetno')
else:
   print ('ne chetno')